const RECIPES = [
  {
    name: 'ไข่เจียว',
    ingredients: ['ไข่ไก่ 1 - 2 ฟอง', 'น้ำมัน', 'ซีอิ๊วขาว'],
    steps: ['ตอกไข่ใส่ชาม และตีให้เข้ากัน', 'เหยาะซีอิ๊วขาว 2-3 หยดในชามไข่', 'เทน้ำมันใส่กระทะให้ทั่ว และ ให้ความร้อนจนเดือด', 'เทไข่ในชามลงกระทะ', 'ทอดจนสุกเหลืองสวย ตักใส่จาน พร้อมเสิร์ฟ']
  },
  {
    name: 'ต้มมาม่า',
    ingredients: ['เส้นมาม่า', 'เครื่องปรุงตามต้องการ'],
    steps: ['เทเส้นมาม่าในน้ำ และ ต้มจนเดือด', 'เมื่อเส้นสุกแล้ว เทน้ำที่ต้มทิ้ง', 'ต้มน้ำให้เดือดอีกครั้ง และใส่เส้นมาม่าสุกลงไป', 'ปรุงเครื่องปรุงตามต้องการ พร้อมเสิร์ฟ']
  },
  {
    name: 'ผัดกะเพรา',
    ingredients: ['พริกขี้หนู', 'พริกหอม', 'กระเทียม', 'น้ำมันพืช 1 ช้อนโต๊ะ', 'น้ำมันหอย 1 ช้อนโต๊ะ', 'น้ำตาลทราย 1 ช้อนชา', 'ซอสปรุงรส 2 ช้อนชา', 'ใบกะเพรา', 'เนื้อไก่ หรือ หมู', 'ข้าวสวย'],
    steps: ['โขลกพริกขี้หนู พริกหอม และ กระเทียมเข้าด้วยกัน', 'ใส่น้ำมันลงกระทะ ใส่เครื่องที่โขลกไว้ และผัดจนหอม', 'ใส่เนื้อไก่หรือหมูลงไปผัด', 'ปรุงรสด้วยน้ำมันหอย น้ำตาลทราย และ ซอสปรุงรส อาจเติมน้ำเปล่าเล็กน้อย', 'ตักใส่จาน เสิร์ฟพร้อมข้าวสวย']
  },
  {
    name: 'หมูทอดกระเทียม',
    ingredients: ['เนื้อหมู (เอาที่ติดมันด้วยอร่อยดี) 500 กรัม', 'กระเทียมแกะเปลือก 1 หัว', 'รากผักชีซอยสี่ราก', 'พริกไทยเม็ด 15 เม็ด', 'น้ำตาลทราย 1 -2 ช้อนโต๊ะ', 'ซีอิ๊วขาว 1 ช้อนโต๊ะ', 'ซอสถั่วเหลือง (ซอสปรุงรส) ½ ช้อนโต๊ะ'],
    steps: ['เนื้อหมูล้างให้สะอาด หั่นเป็นชิ้นไม่หนาจนเกินไป', 'โขลกกระเทียม พริกไทย รากผักชีให้ละเอียด นำไปคลุกกับเนื้อหมูที่หั่นไว้ ตามด้วยเครื่องปรุง ซีอิ๊วขาว น้ำตาลทราย ซอสปรุงรส หมักทิ้งไว้อย่างน้อย 30 นาที ให้เครื่องปรุงต่างๆ ซึมเข้าเนื้อหมู', 'กระทะตั้งไฟปานกลาง ใส่น้ำมันพืชลงไป ประมาณ 1 ช้อนโต๊ะ พอน้ำมันร้อนใส่หมูที่หมักไว้ลงไปผัด ให้สุก', 'ตักขึ้นใส่จานหรือราดข้าว กินกับน้ำปลาพริกหรือซอสพริกกับแตงกวาหั่นชิ้นบาง']
  },
  {
    name: 'สุกี้แห้ง',
    ingredients: ['กระเทียม 7 กลีบ', 'พริกขี้หนูเม็ดใหญ่สีแดง 2-3 เม็ด', 'ผักกาดขาว ประมาณ 1/2 หัว', 'หมูหมัก หรือ ไก่หมัก ประมาณ 2 ถ้วย', 'น้ำจิ้มสุกี้ ตามชอบ', 'วุ้นเส้น แช่น้ำให้นิ่ม 2 ห่อเล็ก', 'ผักบุ้งจีน ประมาณ 10 ต้น', 'ขึ้นฉ่าย 2-3 ต้น', 'ไข่ไก่ 4 ฟอง', 'น้ำมันสำหรับผัด ประมาณ 3-4 ช้อนโต๊ะ'],
    steps: ['ตำกระเทียมและพริกขี้หนูหยาบๆ เตรียมไว้', 'ตั้งหม้อสำหรับต้มน้ำ ใส่เกลือลงไปเล็กน้อย จากนั้นใส่ผักกาดขาวลงลวก', 'ตักขึ้นใส่ลงในน้ำเย็นแล้วบีบน้ำออกให้มากที่สุด พักไว้', 'ลวกหมูให้สุก ตักขึ้น พักไว้', 'นำน้ำจิ้มสุกี้ใส่ลงไปคลุกกับวุ้นเส้นให้ทั่ว', 'ตั้งกระทะพอร้อน ใส่น้ำมันลงไปแล้วตามด้วยกระเทียมกับพริกที่ตำไว้ทันที', 'ผัดพอหอมแล้วใส่ไข่ลงไปกรอกให้ทั่ว ๆ กระทะ', 'ตักใส่จาน พร้อมเสิร์ฟ']
  }
]
